---
kind: event
id: E:Autodesk.Revit.UI.UIControlledApplication.FormulaEditing
source: html/381fdc01-dd95-22ba-7a8b-c05e3f8de33f.htm
---
# Autodesk.Revit.UI.UIControlledApplication.FormulaEditing Event

Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.

## Syntax (C#)
```csharp
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
```